<a href="https://colab.research.google.com/github/Jassii/Exploratory-Data-Analysis-Titanic_dataset-/blob/main/EDA_TITANIC_DATASET.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##EXPLORATORY DATA ANALYSIS

In [ ]:
import pandas as pd
import numpy as np

##READING DATA USING PANDAS

In [ ]:
df = pd.DataFrame(pd.read_csv('train.csv'))   #inorder to read the csv file..later converting the data into DataFrame..
df.head()   #printing the pandas data frame..

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df.shape  #it tells about the shape of the data..(number of rows to the number of columns)

(891, 12)

##HANDLING NULL VALUES

In [ ]:
df.isnull().sum()  #It is used to find the number of null values in each columns and taking sum of the null values present..

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

**Separating out the columns which have more than 35% of the values missing in tha data set**

In [ ]:
drop_col = df.isnull().sum()[df.isnull().sum()>(35/100 * df.shape[0])]   #.shape[0] will return the row portion..(df.shape..index0)..so that it can divide..
drop_col

Cabin    687
dtype: int64

In [ ]:
drop_col.index   #to find the index of that particular column..

Index(['Cabin'], dtype='object')

**NOW WE WILL DROP THE PARTICULAR COLUMN **bold text**

In [ ]:
df.drop(drop_col.index, axis=1, inplace=True)   #here axis =1 is telling about the column..
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

**NOW IT'S TIME TO FILL NA VALUE IN THE DATASET WITH THE MEAN VALUE OF THE REST OF THE DATA**

In [ ]:
df.fillna(df.mean(), inplace=True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [ ]:
df['Embarked'].describe()   #NA values form embarked is not removed because the values stored in it is in string so it is not possible to find the mean of the string values..

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

In [ ]:
df['Embarked'].fillna('S', inplace=True)

In [ ]:
df.isnull().sum()  #now all the NA values have been removed from the data set.

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [ ]:
df.corr()  #It is used to find the correlations from the data set

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

**Now we will make a new column family_size by combining two columns(SibSp and Parch)**

In [ ]:
df['FamilySize'] = df['SibSp'] + df['Parch']

In [ ]:
df.drop(['SibSp','Parch'], axis=1, inplace=True)
df.corr()

             PassengerId  Survived    Pclass       Age      Fare  FamilySize
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658   -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307    0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500    0.065997
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566   -0.248512
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000    0.217138
FamilySize     -0.040143  0.016639  0.065997 -0.248512  0.217138    1.000000

**now we will check whether the person was alone or not**

In [ ]:
df['Alone'] = [0 if df['FamilySize'][i]>0 else 1 for i in df.index]
df.head()

   PassengerId  Survived  Pclass  ... Embarked FamilySize  Alone
0            1         0       3  ...        S          1      0
1            2         1       1  ...        C          1      0
2            3         1       3  ...        S          0      1
3            4         1       1  ...        S          1      0
4            5         0       3  ...        S          0      1

[5 rows x 11 columns]

In [ ]:
df.groupby(['Alone'])['Survived'].mean()

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

In [ ]:
df[['Alone','Fare']].corr()   #finding the correlation between Alone and Fare..

          Alone      Fare
Alone  1.000000 -0.271832
Fare  -0.271832  1.000000

In [ ]:
df['Sex'] = [0 if df['Sex'][i]=='male' else 1 for i in df.index]  #1 for female, 0 for male
df.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

**It shows that female passengers have been prioritized over men..**